Hi @amrawadk,

Firstly, I would like to Thank You for using my version of Stripe Provider.

Secondly, I am glad you opened a ticket when something doesn't work as you expect.

I was trying to replicate your issue and I agree that the "upTo" value change doesn't update the Stripe side. However, it should trigger the replacement - The old price will be removed and new one created.

Let me share the flow from my end based on the latest version of Stripe Provider (3.3.2):

HCL code which should mirror your example:
```
resource "stripe_price" "price" {
  currency = "usd"
  product  = stripe_product.product.id
  recurring {
    interval = "month"
    interval_count = 1
  }
  billing_scheme = "tiered"
  tiers_mode = "graduated"
  tiers {
    flat_amount = 10000
    up_to = 5
  }
  tiers {
    unit_amount = 1000
    up_to = -1
  }
}
```

Running the `terraform plan` give me this outcome:
```
Terraform will perform the following actions:

  # stripe_price.price will be created
  + resource "stripe_price" "price" {
      + active              = true
      + billing_scheme      = "tiered"
      + currency            = "usd"
      + id                  = (known after apply)
      + product             = (known after apply)
      + tax_behavior        = "unspecified"
      + tiers_mode          = "graduated"
      + transfer_lookup_key = false
      + type                = (known after apply)
      + unit_amount         = (known after apply)
      + unit_amount_decimal = (known after apply)

      + recurring {
          + interval       = "month"
          + interval_count = 1
          + usage_type     = "licensed"
        }

      + tiers {
          + flat_amount         = 10000
          + flat_amount_decimal = (known after apply)
          + unit_amount         = (known after apply)
          + unit_amount_decimal = (known after apply)
          + up_to               = 2
        }
      + tiers {
          + flat_amount         = (known after apply)
          + flat_amount_decimal = (known after apply)
          + unit_amount         = 1000
          + unit_amount_decimal = (known after apply)
          + up_to               = -1
        }
    }

  # stripe_product.product will be created
  + resource "stripe_product" "product" {
      + active     = true
      + id         = (known after apply)
      + name       = "product"
      + product_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
``` 

When I change the "up_to" value from 2 to let say 5 and run the `terraform plan`:
```
Terraform will perform the following actions:

  # stripe_price.price must be replaced
-/+ resource "stripe_price" "price" {
      ~ id                  = "price_1RrqkGFTpIuUjmTAbGVcmMa3" -> (known after apply)
      - metadata            = {} -> null
      ~ type                = "recurring" -> (known after apply)
      + unit_amount         = (known after apply)
      + unit_amount_decimal = (known after apply)
        # (9 unchanged attributes hidden)

      ~ tiers {
          ~ flat_amount_decimal = 10000 -> (known after apply)
          ~ unit_amount         = 0 -> (known after apply)
          ~ unit_amount_decimal = 0 -> (known after apply)
          ~ up_to               = 2 -> 5 # forces replacement
            # (1 unchanged attribute hidden)
        }
      ~ tiers {
          ~ flat_amount         = 0 -> (known after apply)
          ~ flat_amount_decimal = 0 -> (known after apply)
          ~ unit_amount_decimal = 1000 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
As you can see the price resource will be replaced with new one, which will be reflected in Stripe when I apply changes.